# 덧셈
print(4 + 7.0)
# 하나만 소수형일 때 출력은 소수형

# 뺄셈
print(2.0 - 4)

# 곱셈
print(5.0 * 3)

# 나머지
print(7 % 3.0)

# 거듭제곱
print(2.0 ** 3)

# 나누기
print(7 / 2)
print(6 / 2)
print(7.0 / 2)
print(6.0 / 2.0)
# 나눗셈은 무조건 소수형으로 출력된다.

# 사칙연산
print(2 + 3 * 2)
print((2 + 3) * 2)

# floor division (버림 나눗셈)
# 뒤에 소수부분을 버린 채 출력된다.
print(7 // 2)
print(8 // 3)
print(8.0 // 3) # 두 수에서 하나가 소수형이면 결과는 소수형이 나온다.
print(8.0 // 3.0)

# round (반올림
print(round(3.1415926535))
# 만약 소수점 둘째자리로 반올림 하고 싶으면?
print(round(3.1415926535, 2))
print(round(3.1415926535, 4))
